In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [38]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column1","Column2","Column3"])

In [39]:
df

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587
B -0.603920  0.832835  0.363158
C -0.016465 -0.944698 -1.021571
D -2.324417 -0.694938  0.628330

In [40]:
df>-1

   Column1  Column2  Column3
A     True     True     True
B     True     True     True
C     True     True    False
D    False     True     True

In [41]:
booleanDf = df>0

In [42]:
booleanDf

   Column1  Column2  Column3
A     True     True    False
B    False     True     True
C    False    False    False
D    False    False     True

In [43]:
df[booleanDf]

    Column1   Column2   Column3
A  0.242761  0.606046       NaN
B       NaN  0.832835  0.363158
C       NaN       NaN       NaN
D       NaN       NaN  0.628330

In [44]:
df[df>-1]

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587
B -0.603920  0.832835  0.363158
C -0.016465 -0.944698       NaN
D       NaN -0.694938  0.628330

In [45]:
df["Column1"]

A    0.242761
B   -0.603920
C   -0.016465
D   -2.324417
Name: Column1, dtype: float64

In [46]:
df["Column1"]>0

A     True
B    False
C    False
D    False
Name: Column1, dtype: bool

In [47]:
df[df["Column1"]>0] # yukarıda, B ve D satırları False olduğu için onları getirmedi.

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587

In [48]:
df["Column1"]>0.5

A    False
B    False
C    False
D    False
Name: Column1, dtype: bool

In [49]:
df[df["Column1"]>0.5]

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [50]:
df[df["Column1"]>0]

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587

In [51]:
df[df["Column2"]>0]

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587
B -0.603920  0.832835  0.363158

In [52]:
df[(df["Column1"]>0) & (df["Column2"]>0)] # pandas da "and" yerine "&" kullanılıyor !

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587

In [53]:
df[(df["Column1"]>0) | (df["Column2"]>0)] # pandas da "or" yerine "|" kullanılıyor !

    Column1   Column2   Column3
A  0.242761  0.606046 -0.658587
B -0.603920  0.832835  0.363158

In [54]:
df["Column4"] = pd.Series(randn(4),["A","B","C","D"]) # (*)

In [55]:
df

    Column1   Column2   Column3   Column4
A  0.242761  0.606046 -0.658587 -0.126410
B -0.603920  0.832835  0.363158 -0.773322
C -0.016465 -0.944698 -1.021571 -0.627661
D -2.324417 -0.694938  0.628330  1.151577

In [56]:
df["Column5"]= randn(4) # (*) yukarıdakinin yerine kullanılabilir.Aynı işi görür.

In [57]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.242761  0.606046 -0.658587 -0.126410  1.018930
B -0.603920  0.832835  0.363158 -0.773322  0.250657
C -0.016465 -0.944698 -1.021571 -0.627661  1.398307
D -2.324417 -0.694938  0.628330  1.151577  0.412010

In [58]:
df["Column6"] = ["newValue1","newValue2","newValue3","newValue4"]

In [59]:
df

    Column1   Column2   Column3   Column4   Column5    Column6
A  0.242761  0.606046 -0.658587 -0.126410  1.018930  newValue1
B -0.603920  0.832835  0.363158 -0.773322  0.250657  newValue2
C -0.016465 -0.944698 -1.021571 -0.627661  1.398307  newValue3
D -2.324417 -0.694938  0.628330  1.151577  0.412010  newValue4

In [60]:
df.set_index("Column6")

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.242761  0.606046 -0.658587 -0.126410  1.018930
newValue2 -0.603920  0.832835  0.363158 -0.773322  0.250657
newValue3 -0.016465 -0.944698 -1.021571 -0.627661  1.398307
newValue4 -2.324417 -0.694938  0.628330  1.151577  0.412010

In [61]:
df # değişmediği görülüyor.Yukarıdakinden farklı!

    Column1   Column2   Column3   Column4   Column5    Column6
A  0.242761  0.606046 -0.658587 -0.126410  1.018930  newValue1
B -0.603920  0.832835  0.363158 -0.773322  0.250657  newValue2
C -0.016465 -0.944698 -1.021571 -0.627661  1.398307  newValue3
D -2.324417 -0.694938  0.628330  1.151577  0.412010  newValue4

In [62]:
df.set_index("Column6",inplace = True) # kaydedilmesi için !

In [63]:
df

            Column1   Column2   Column3   Column4   Column5
Column6
newValue1  0.242761  0.606046 -0.658587 -0.126410  1.018930
newValue2 -0.603920  0.832835  0.363158 -0.773322  0.250657
newValue3 -0.016465 -0.944698 -1.021571 -0.627661  1.398307
newValue4 -2.324417 -0.694938  0.628330  1.151577  0.412010

In [65]:
df.index.names

FrozenList(['Column6'])